tutorials/Roulund2005_scour/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.28;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    inlet
    {
        type            timeVaryingMappedFixedValue;
        mapMethod       nearest;
        offset          constant 0;
        value           uniform 0.28;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
    pier
    {
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        type            omegaWallFunction;
        value           uniform 0.28;
    }
}


// ************************************************************************* //
